samples/expression_tree_dot/complex.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node1"];
  "node2" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node2"];
  "node3" [label = "e", fillcolor = "lightblue", style = "filled", name = "node3"];
  "node4" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node4"];
  "node5" [label = "a", fillcolor = "lightblue", style = "filled", name = "node5"];
  "node6" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node6"];
  "node7" [label = "b", fillcolor = "lightblue", style = "filled", name = "node7"];
  "node8" [label = "XOR", fillcolor = "lightpink", style = "filled", name = "node8"];
  "node9" [label = "c", fillcolor = "lightblue", style = "filled", name = "node9"];
  "node10" [label = "d", fillcolor = "lightblue", style = "filled", name = "node10"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
  "node2" -> "node4";
  "node4" -> "node5" [label = "L"];
  "node4" -> "node6" [label = "R"];
  "node6" -> "node7" [label = "L"];
  "node6" -> "node8" [label = "R"];
  "node8" -> "node9" [label = "L"];
  "node8" -> "node10" [label = "R"];
}
